//https://leetcode.com/problems/fruit-into-baskets/

// Задача: У вас есть массив чисел. Каждое число представляет "тип". Ваша задача — найти
//  самый длинный подмассив, в котором содержатся не более двух уникальных типов чисел.

// Пример:

// Допустим, у вас есть массив [1, 2, 1, 2, 3].
// В этом массиве подмассив [1, 2, 1, 2] содержит только два типа чисел (1 и 2) и является
//  самым длинным таким подмассивом. Подмассив [2, 1, 2, 3] уже содержит три разных типа 
//  чисел, что больше допустимого.

let totalFruit = function(fruits) {   

};

totalFruit([1,1,2,2,3]); //4
totalFruit([1,2,3,2,2]); //4
totalFruit([0,1,2,2]); //3